Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ2025DAB169.atdf
         <register caption="ADC0 Configuration Register" name="ADC0CFG" offset="0x600" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC1 Configuration Register" name="ADC1CFG" offset="0x604" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC2 Configuration Register" name="ADC2CFG" offset="0x608" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC3 Configuration Register" name="ADC3CFG" offset="0x60c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC4 Configuration Register" name="ADC4CFG" offset="0x610" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC7 Configuration Register" name="ADC7CFG" offset="0x61c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC System Configuration Register 0" name="ADCSYSCFG0" offset="0x640" rw="R" size="4">
            <bitfield mask="0x00000001" name="AN0" />
            <bitfield mask="0x00000002" name="AN1" />
            <bitfield mask="0x00000004" name="AN2" />
            <bitfield mask="0x00000008" name="AN3" />
            <bitfield mask="0x00000010" name="AN4" />
            <bitfield mask="0x00000020" name="AN5" />
            <bitfield mask="0x00000040" name="AN6" />
            <bitfield mask="0x00000080" name="AN7" />
            <bitfield mask="0x00000100" name="AN8" />
            <bitfield mask="0x00000200" name="AN9" />
            <bitfield mask="0x00000400" name="AN10" />
            <bitfield mask="0x00000800" name="AN11" />
            <bitfield mask="0x00001000" name="AN12" />
            <bitfield mask="0x00002000" name="AN13" />
            <bitfield mask="0x00004000" name="AN14" />
            <bitfield mask="0x00008000" name="AN15" />
            <bitfield mask="0x00010000" name="AN16" />
            <bitfield mask="0x00020000" name="AN17" />
            <bitfield mask="0x00040000" name="AN18" />
            <bitfield mask="0x00080000" name="AN19" />
            <bitfield mask="0x00100000" name="AN20" />
            <bitfield mask="0x00200000" name="AN21" />
            <bitfield mask="0x00400000" name="AN22" />
            <bitfield mask="0x00800000" name="AN23" />
            <bitfield mask="0x01000000" name="AN24" />
            <bitfield mask="0x02000000" name="AN25" />
            <bitfield mask="0x04000000" name="AN26" />
            <bitfield mask="0x08000000" name="AN27" />
            <bitfield mask="0x10000000" name="AN28" />
            <bitfield mask="0x20000000" name="AN29" />
            <bitfield mask="0x40000000" name="AN30" />
            <bitfield mask="0x80000000" name="AN31" />
         </register>
         <register caption="ADC System Configuration Register 1" name="ADCSYSCFG1" offset="0x644" rw="R" size="4">
            <bitfield mask="0x00000001" name="AN32" />
            <bitfield mask="0x00000002" name="AN33" />
            <bitfield mask="0x00000004" name="AN34" />
            <bitfield mask="0x00000008" name="AN35" />
            <bitfield mask="0x00000010" name="AN36" />
            <bitfield mask="0x00000020" name="AN37" />
            <bitfield mask="0x00000040" name="AN38" />
            <bitfield mask="0x00000080" name="AN39" />
            <bitfield mask="0x00000100" name="AN40" />
            <bitfield mask="0x00000200" name="AN41" />
            <bitfield mask="0x00000400" name="AN42" />
            <bitfield mask="0x00000800" name="AN43" />
            <bitfield mask="0x00001000" name="AN44" />
            <bitfield mask="0x00002000" name="AN45" />
            <bitfield mask="0x00004000" name="AN46" />
            <bitfield mask="0x00008000" name="AN47" />
            <bitfield mask="0x00010000" name="AN48" />
            <bitfield mask="0x00020000" name="AN49" />
            <bitfield mask="0x00040000" name="AN50" />
            <bitfield mask="0x00080000" name="AN51" />
            <bitfield mask="0x00100000" name="AN52" />
            <bitfield mask="0x00200000" name="AN53" />
            <bitfield mask="0x00400000" name="AN54" />
            <bitfield mask="0x00800000" name="AN55" />
            <bitfield mask="0x01000000" name="AN56" />
            <bitfield mask="0x02000000" name="AN57" />
            <bitfield mask="0x04000000" name="AN58" />
            <bitfield mask="0x08000000" name="AN59" />
            <bitfield mask="0x10000000" name="AN60" />
            <bitfield mask="0x20000000" name="AN61" />
            <bitfield mask="0x40000000" name="AN62" />
            <bitfield mask="0x80000000" name="AN63" />
         </register>
         <register caption="ADC0 Output Data Register" name="ADCDATA0" offset="0xa00" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC1 Output Data Register" name="ADCDATA1" offset="0xa04" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC2 Output Data Register" name="ADCDATA2" offset="0xa08" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC3 Output Data Register" name="ADCDATA3" offset="0xa0c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC4 Output Data Register" name="ADCDATA4" offset="0xa10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC5 Output Data Register" name="ADCDATA5" offset="0xa14" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC6 Output Data Register" name="ADCDATA6" offset="0xa18" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC7 Output Data Register" name="ADCDATA7" offset="0xa1c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC8 Output Data Register" name="ADCDATA8" offset="0xa20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC9 Output Data Register" name="ADCDATA9" offset="0xa24" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC10 Output Data Register" name="ADCDATA10" offset="0xa28" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC11 Output Data Register" name="ADCDATA11" offset="0xa2c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC12 Output Data Register" name="ADCDATA12" offset="0xa30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC13 Output Data Register" name="ADCDATA13" offset="0xa34" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
