Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ2025DAB169.atdf
         <register caption="" name="DSGPR31" offset="0xb8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR32" offset="0xbc" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
      </register-group>
   </module>
   <module caption="" id="00109" name="EBI" version="1">
      <register-group name="EBI">
         <register caption="External Bus Interface Chip Select Register" name="EBICS0" offset="0x0" rw="RW" size="4">
            <bitfield caption="Base Address for Device bits" mask="0xFFFF0000" name="CSADDR"/>
         </register>
         <register caption="External Bus Interface Chip Select Register" name="EBICS1" offset="0x4" rw="RW" size="4">
            <bitfield caption="Base Address for Device bits" mask="0xFFFF0000" name="CSADDR"/>
         </register>
         <register caption="External Bus Interface Chip Select Register" name="EBICS2" offset="0x8" rw="RW" size="4">
            <bitfield caption="Base Address for Device bits" mask="0xFFFF0000" name="CSADDR"/>
         </register>
         <register caption="External Bus Interface Chip Select Register" name="EBICS3" offset="0xc" rw="RW" size="4">
            <bitfield caption="Base Address for Device bits" mask="0xFFFF0000" name="CSADDR"/>
         </register>
         <register caption="External Bus Interface Address Mask Register" name="EBIMSK0" offset="0x40" rw="RW" size="4">
            <bitfield caption="Select Memory Size for Chip Select 'x' bits" mask="0x0000001F" name="MEMSIZE" values="EBIMSK0__MEMSIZE"/>
            <bitfield caption="Select Memory Type for Chip Select 'x' bits" mask="0x000000E0" name="MEMTYPE" values="EBIMSK0__MEMTYPE"/>
            <bitfield caption="Timing Register Set for Chip Select 'x' bits" mask="0x00000700" name="REGSEL" values="EBIMSK0__REGSEL"/>
         </register>
         <register caption="External Bus Interface Address Mask Register" name="EBIMSK1" offset="0x44" rw="RW" size="4">
            <bitfield caption="Select Memory Size for Chip Select 'x' bits" mask="0x0000001F" name="MEMSIZE" values="EBIMSK1__MEMSIZE"/>
            <bitfield caption="Select Memory Type for Chip Select 'x' bits" mask="0x000000E0" name="MEMTYPE" values="EBIMSK1__MEMTYPE"/>
            <bitfield caption="Timing Register Set for Chip Select 'x' bits" mask="0x00000700" name="REGSEL" values="EBIMSK1__REGSEL"/>
         </register>
         <register caption="External Bus Interface Address Mask Register" name="EBIMSK2" offset="0x48" rw="RW" size="4">
            <bitfield caption="Select Memory Size for Chip Select 'x' bits" mask="0x0000001F" name="MEMSIZE" values="EBIMSK2__MEMSIZE"/>
            <bitfield caption="Select Memory Type for Chip Select 'x' bits" mask="0x000000E0" name="MEMTYPE" values="EBIMSK2__MEMTYPE"/>
            <bitfield caption="Timing Register Set for Chip Select 'x' bits" mask="0x00000700" name="REGSEL" values="EBIMSK2__REGSEL"/>
         </register>
         <register caption="External Bus Interface Address Mask Register" name="EBIMSK3" offset="0x4c" rw="RW" size="4">
            <bitfield caption="Select Memory Size for Chip Select 'x' bits" mask="0x0000001F" name="MEMSIZE" values="EBIMSK3__MEMSIZE"/>
            <bitfield caption="Select Memory Type for Chip Select 'x' bits" mask="0x000000E0" name="MEMTYPE" values="EBIMSK3__MEMTYPE"/>
            <bitfield caption="Timing Register Set for Chip Select 'x' bits" mask="0x00000700" name="REGSEL" values="EBIMSK3__REGSEL"/>
         </register>
         <register caption="External Bus Interface Static Memory Timing Register" name="EBISMT0" offset="0x80" rw="RW" size="4">
            <bitfield caption="Read Cycle Time bits" mask="0x0000003F" name="TRC"/>
            <bitfield caption="Write Address Setup Time bits" mask="0x000000C0" name="TAS"/>
            <bitfield caption="Write Address/Data Hold Time bits" mask="0x00000300" name="TWR"/>
            <bitfield caption="Write Pulse Width bits" mask="0x0000FC00" name="TWP"/>
            <bitfield caption="Data Bus Turnaround Time bits" mask="0x00070000" name="TBTA"/>
            <bitfield caption="Page Mode Read Cycle Time bits" mask="0x00780000" name="TPRC"/>
            <bitfield caption="Memory Device Page Mode Support bit" mask="0x00800000" name="PAGEMODE" values="EBISMT0__PAGEMODE"/>
            <bitfield caption="Page Size for Page Mode Device bits" mask="0x03000000" name="PAGESIZE" values="EBISMT0__PAGESIZE"/>
            <bitfield caption="Data Ready Device Select bit" mask="0x04000000" name="RDYMODE" values="EBISMT0__RDYMODE"/>
         </register>
         <register caption="External Bus Interface Static Memory Timing Register" name="EBISMT1" offset="0x84" rw="RW" size="4">
            <bitfield caption="Read Cycle Time bits" mask="0x0000003F" name="TRC"/>
            <bitfield caption="Write Address Setup Time bits" mask="0x000000C0" name="TAS"/>
            <bitfield caption="Write Address/Data Hold Time bits" mask="0x00000300" name="TWR"/>
            <bitfield caption="Write Pulse Width bits" mask="0x0000FC00" name="TWP"/>
            <bitfield caption="Data Bus Turnaround Time bits" mask="0x00070000" name="TBTA"/>
            <bitfield caption="Page Mode Read Cycle Time bits" mask="0x00780000" name="TPRC"/>
            <bitfield caption="Memory Device Page Mode Support bit" mask="0x00800000" name="PAGEMODE" values="EBISMT1__PAGEMODE"/>
            <bitfield caption="Page Size for Page Mode Device bits" mask="0x03000000" name="PAGESIZE" values="EBISMT1__PAGESIZE"/>
            <bitfield caption="Data Ready Device Select bit" mask="0x04000000" name="RDYMODE" values="EBISMT1__RDYMODE"/>
         </register>
         <register caption="External Bus Interface Static Memory Timing Register" name="EBISMT2" offset="0x88" rw="RW" size="4">
            <bitfield caption="Read Cycle Time bits" mask="0x0000003F" name="TRC"/>
            <bitfield caption="Write Address Setup Time bits" mask="0x000000C0" name="TAS"/>
            <bitfield caption="Write Address/Data Hold Time bits" mask="0x00000300" name="TWR"/>
            <bitfield caption="Write Pulse Width bits" mask="0x0000FC00" name="TWP"/>
            <bitfield caption="Data Bus Turnaround Time bits" mask="0x00070000" name="TBTA"/>
            <bitfield caption="Page Mode Read Cycle Time bits" mask="0x00780000" name="TPRC"/>
            <bitfield caption="Memory Device Page Mode Support bit" mask="0x00800000" name="PAGEMODE" values="EBISMT2__PAGEMODE"/>
            <bitfield caption="Page Size for Page Mode Device bits" mask="0x03000000" name="PAGESIZE" values="EBISMT2__PAGESIZE"/>
            <bitfield caption="Data Ready Device Select bit" mask="0x04000000" name="RDYMODE" values="EBISMT2__RDYMODE"/>
         </register>
         <register caption="External Bus Interface Flash Timing Register" name="EBIFTRPD" offset="0x8c" rw="RW" size="4">
            <bitfield caption="Flash Timing bits" mask="0xFFFFFFFF" name="TRPD"/>
         </register>
         <register caption="External Bus Interface Static Memory Control Register" name="EBISMCON" offset="0x90" rw="RW" size="4">
            <bitfield caption="Flash Reset/Power-down mode Select bit" mask="0x00000001" name="SMRP" values="EBISMCON__SMRP"/>
            <bitfield caption="Static Memory Width for Register EBISMT0 bits" mask="0x00000380" name="SMDWIDTH0" values="EBISMCON__SMDWIDTH0"/>
            <bitfield caption="Static Memory Width for Register EBISMT1 bits" mask="0x00001C00" name="SMDWIDTH1" values="EBISMCON__SMDWIDTH1"/>
            <bitfield caption="Static Memory Width for Register EBISMT2 bits" mask="0x0000E000" name="SMDWIDTH2" values="EBISMCON__SMDWIDTH2"/>
         </register>
      </register-group>
      <value-group caption="Select Memory Size for Chip Select 'x' bits" name="EBIMSK0__MEMSIZE">
         <value caption="Reserved" name="" value="0x1f"/>
         <value caption="Reserved" name="" value="0xa"/>
         <value caption="16 MB" name="" value="0x9"/>
         <value caption="8 MB" name="" value="0x8"/>
         <value caption="4 MB" name="" value="0x7"/>
         <value caption="2 MB" name="" value="0x6"/>
         <value caption="1 MB" name="" value="0x5"/>
         <value caption="512 KB" name="" value="0x4"/>
         <value caption="256 KB" name="" value="0x3"/>
         <value caption="128 KB" name="" value="0x2"/>
         <value caption="64 KB (smaller memories alias within this range)" name="" value="0x1"/>
         <value caption="Chip Select is not used" name="" value="0x0"/>
      </value-group>
      <value-group caption="Select Memory Type for Chip Select 'x' bits" name="EBIMSK0__MEMTYPE">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="NOR-Flash" name="" value="0x2"/>
         <value caption="SRAM" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timing Register Set for Chip Select 'x' bits" name="EBIMSK0__REGSEL">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Use EBISMT2" name="" value="0x2"/>
         <value caption="Use EBISMT1" name="" value="0x1"/>
         <value caption="Use EBISMT0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Select Memory Size for Chip Select 'x' bits" name="EBIMSK1__MEMSIZE">
         <value caption="Reserved" name="" value="0x1f"/>
         <value caption="Reserved" name="" value="0xa"/>
         <value caption="16 MB" name="" value="0x9"/>
         <value caption="8 MB" name="" value="0x8"/>
         <value caption="4 MB" name="" value="0x7"/>
         <value caption="2 MB" name="" value="0x6"/>
         <value caption="1 MB" name="" value="0x5"/>
         <value caption="512 KB" name="" value="0x4"/>
         <value caption="256 KB" name="" value="0x3"/>
         <value caption="128 KB" name="" value="0x2"/>
         <value caption="64 KB (smaller memories alias within this range)" name="" value="0x1"/>
         <value caption="Chip Select is not used" name="" value="0x0"/>
      </value-group>
