Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ2025DAB169.atdf
      <value-group caption="Active bit" name="GLCDSTAT__ACTIVE">
         <value caption="LCD Controller is not in active vertical blanking" name="" value="0x1" />
         <value caption="LCD Controller is in active vertical blanking" name="" value="0x0" />
      </value-group>
      <value-group caption="Last Row bit" name="GLCDSTAT__LROW">
         <value caption="Last row is currently being displayed" name="" value="0x1" />
         <value caption="Last row is not currently being displayed" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02467" name="GPIO" version="1">
      <register-group name="GPIO">
         <register caption="" name="ANSELA" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000002" name="ANSA1" />
            <bitfield mask="0x00000020" name="ANSA5" />
            <bitfield mask="0x00000200" name="ANSA9" />
            <bitfield mask="0x00000400" name="ANSA10" />
         </register>
         <register caption="" name="ANSELB" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSB0" />
            <bitfield mask="0x00000002" name="ANSB1" />
            <bitfield mask="0x00000004" name="ANSB2" />
            <bitfield mask="0x00000008" name="ANSB3" />
            <bitfield mask="0x00000010" name="ANSB4" />
            <bitfield mask="0x00000020" name="ANSB5" />
            <bitfield mask="0x00000080" name="ANSB7" />
            <bitfield mask="0x00000100" name="ANSB8" />
            <bitfield mask="0x00000200" name="ANSB9" />
            <bitfield mask="0x00000400" name="ANSB10" />
            <bitfield mask="0x00000800" name="ANSB11" />
            <bitfield mask="0x00001000" name="ANSB12" />
            <bitfield mask="0x00002000" name="ANSB13" />
            <bitfield mask="0x00004000" name="ANSB14" />
            <bitfield mask="0x00008000" name="ANSB15" />
         </register>
         <register caption="" name="ANSELC" offset="0x200" rw="RW" size="4">
            <bitfield mask="0x00000002" name="ANSC1" />
            <bitfield mask="0x00000004" name="ANSC2" />
            <bitfield mask="0x00000008" name="ANSC3" />
            <bitfield mask="0x00000010" name="ANSC4" />
         </register>
         <register caption="" name="ANSELD" offset="0x300" rw="RW" size="4">
            <bitfield mask="0x00004000" name="ANSD14" />
            <bitfield mask="0x00008000" name="ANSD15" />
         </register>
         <register caption="" name="ANSELE" offset="0x400" rw="RW" size="4">
            <bitfield mask="0x00000002" name="ANSE1" />
            <bitfield mask="0x00000010" name="ANSE4" />
            <bitfield mask="0x00000040" name="ANSE6" />
            <bitfield mask="0x00000080" name="ANSE7" />
            <bitfield mask="0x00000100" name="ANSE8" />
            <bitfield mask="0x00000200" name="ANSE9" />
         </register>
         <register caption="" name="ANSELF" offset="0x500" rw="RW" size="4">
            <bitfield mask="0x00001000" name="ANSF12" />
            <bitfield mask="0x00002000" name="ANSF13" />
         </register>
         <register caption="" name="ANSELG" offset="0x600" rw="RW" size="4">
            <bitfield mask="0x00000040" name="ANSG6" />
            <bitfield mask="0x00000080" name="ANSG7" />
            <bitfield mask="0x00000100" name="ANSG8" />
            <bitfield mask="0x00000200" name="ANSG9" />
            <bitfield mask="0x00008000" name="ANSG15" />
         </register>
         <register caption="" name="ANSELH" offset="0x700" rw="RW" size="4">
            <bitfield mask="0x00000008" name="ANSH3" />
            <bitfield mask="0x00000010" name="ANSH4" />
            <bitfield mask="0x00000080" name="ANSH7" />
            <bitfield mask="0x00000800" name="ANSH11" />
         </register>
         <register caption="" name="ANSELJ" offset="0x800" rw="RW" size="4">
            <bitfield mask="0x00000004" name="ANSJ2" />
         </register>
         <register caption="" name="ANSELK" offset="0x900" rw="RW" size="4">
            <bitfield mask="0x00000002" name="ANSK1" />
            <bitfield mask="0x00000004" name="ANSK2" />
         </register>
         <register caption="" name="TRISA" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISA0" />
            <bitfield mask="0x00000002" name="TRISA1" />
            <bitfield mask="0x00000004" name="TRISA2" />
            <bitfield mask="0x00000008" name="TRISA3" />
            <bitfield mask="0x00000010" name="TRISA4" />
            <bitfield mask="0x00000020" name="TRISA5" />
            <bitfield mask="0x00000040" name="TRISA6" />
            <bitfield mask="0x00000080" name="TRISA7" />
            <bitfield mask="0x00000200" name="TRISA9" />
            <bitfield mask="0x00000400" name="TRISA10" />
            <bitfield mask="0x00004000" name="TRISA14" />
            <bitfield mask="0x00008000" name="TRISA15" />
         </register>
         <register caption="" name="TRISB" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISB0" />
            <bitfield mask="0x00000002" name="TRISB1" />
            <bitfield mask="0x00000004" name="TRISB2" />
            <bitfield mask="0x00000008" name="TRISB3" />
            <bitfield mask="0x00000010" name="TRISB4" />
            <bitfield mask="0x00000020" name="TRISB5" />
            <bitfield mask="0x00000040" name="TRISB6" />
            <bitfield mask="0x00000080" name="TRISB7" />
            <bitfield mask="0x00000100" name="TRISB8" />
            <bitfield mask="0x00000200" name="TRISB9" />
            <bitfield mask="0x00000400" name="TRISB10" />
            <bitfield mask="0x00000800" name="TRISB11" />
            <bitfield mask="0x00001000" name="TRISB12" />
            <bitfield mask="0x00002000" name="TRISB13" />
            <bitfield mask="0x00004000" name="TRISB14" />
            <bitfield mask="0x00008000" name="TRISB15" />
         </register>
