Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ2025DAB169.atdf
         <register caption="" name="SBT14WR0" offset="0x20838" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT14WR0__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT14WR0__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT14WR0__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT14WR0__GROUP3" />
         </register>
         <register caption="" name="SBT14WR1" offset="0x20858" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT14WR1__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT14WR1__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT14WR1__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT14WR1__GROUP3" />
         </register>
         <register caption="" name="SBT15WR0" offset="0x20C38" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT15WR0__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT15WR0__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT15WR0__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT15WR0__GROUP3" />
         </register>
         <register caption="" name="SBT16WR0" offset="0x34438" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT16WR0__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT16WR0__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT16WR0__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT16WR0__GROUP3" />
         </register>
         <register caption="" name="SBT16WR1" offset="0x34458" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT16WR1__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT16WR1__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT16WR1__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT16WR1__GROUP3" />
         </register>
         <register caption="" name="SBT16WR2" offset="0x34478" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT16WR2__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT16WR2__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT16WR2__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT16WR2__GROUP3" />
         </register>
         <register caption="" name="SBT16WR3" offset="0x34498" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT16WR3__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT16WR3__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT16WR3__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT16WR3__GROUP3" />
         </register>
         <register caption="" name="SBT16WR4" offset="0x344B8" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT16WR4__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT16WR4__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT16WR4__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT16WR4__GROUP3" />
         </register>
      </register-group>
      <value-group caption="Transaction Command of the Requester bits" name="SBT0ELOG1__CMD">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Write (a non-posted write)" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Read (a locked read caused by a Read-Modify-Write transaction)" name="" value="0x3" />
         <value caption="Read" name="" value="0x2" />
         <value caption="Write" name="" value="0x1" />
         <value caption="Idle" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Region Number bits" name="SBT0ELOG1__REGION">
         <value caption="Targets region that reported a permission group violation" name="" value="1111 - 0000" />
      </value-group>
      <value-group caption="Initiator ID of Requester bits" name="SBT0ELOG1__INITID">
         <value caption="Reserved" name="" value="0xff" />
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Crypto Engine" name="" value="0xe" />
         <value caption="Flash Controller" name="" value="0xd" />
         <value caption="SQI1" name="" value="0xc" />
         <value caption="CAN2" name="" value="0xb" />
         <value caption="CAN1" name="" value="0xa" />
         <value caption="Ethernet Write" name="" value="0x9" />
         <value caption="Ethernet Read" name="" value="0x8" />
         <value caption="USB" name="" value="0x7" />
         <value caption="DMA Write (DMAPRI (CFGCON) = 1)" name="" value="0x6" />
         <value caption="DMA Write (DMAPRI (CFGCON) = 0)" name="" value="0x5" />
         <value caption="DMA Read (DMAPRI (CFGCON) = 1)" name="" value="0x4" />
         <value caption="DMA Read (DMAPRI (CFGCON) = 0)" name="" value="0x3" />
         <value caption="CPU (CPUPRI (CFGCON) = 1)" name="" value="0x2" />
         <value caption="CPU (CPUPRI (CFGCON) = 0)" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Code bits" name="SBT0ELOG1__CODE">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Permission violation" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Reserved" name="" value="0x1" />
         <value caption="No error" name="" value="0x0" />
      </value-group>
      <value-group caption="Multiple Permission Violations Status bit" name="SBT0ELOG1__MULTI">
         <value caption="Multiple errors have been detected" name="" value="0x1" />
         <value caption="No multiple errors have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Transaction Command of the Requester bits" name="SBT1ELOG1__CMD">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Write (a non-posted write)" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Read (a locked read caused by a Read-Modify-Write transaction)" name="" value="0x3" />
         <value caption="Read" name="" value="0x2" />
         <value caption="Write" name="" value="0x1" />
         <value caption="Idle" name="" value="0x0" />
      </value-group>
